# MSTFN Model

# Parameters
nc: 1  # number of classes
action_nc: 4
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
H: 3
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]                  [1,3,640,640]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2        [1,64,320,320]              [1,64,4,320,320]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4          [1,128,160,160]
   [-1, 3, C3, [128]],           #                [1,128,160,160]
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8          [1,256,80,80]
   [-1, 6, C3, [256]],          #                 [1,256,80,80]*
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16         [1,512,40,40]
   [-1, 9, C3, [512]],          #                 [1,512,40,40]*
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32        [1,1024,20,20]
   [-1, 3, C3, [1024]],           #               [1,1024,20,20]
   [-1, 1, SPPF, [1024, 5]],  # 9                 [1,1024,20,20]
   [-1, 2, C2PSA, [1024]], # 10
  ]

head:
  [[-1, 1, Conv3D, [512, 1, 1]],              #           [1,512,20,20]*
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #       [1,512,40,40]
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4        [1,1024,40,40]
   [-1, 3, C33D, [512, False]],  # 13                     [1,512,40,40]

   [-1, 1, Conv3D, [256, 1, 1]],          #               [1,256,40,40]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #        [1,256,80,80]
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3        [1,512,80,80]
   [-1, 3, C33D, [256, False]],  # 17 (P3/8-small)        [1,256,80,80]**

   [-1, 1, Conv3D, [256, 3, 2]],      #                   [1,256,40,40]
   [[-1, 15], 1, Concat, [1]],  # cat head P4           [1,512,40,40]
   [-1, 3, C33D, [512, False]],  # 20 (P4/16-medium)      [1,512,40,40]**

   [-1, 1, Conv3D, [512, 3, 2]],      #                   [1,512,20,20]
   [[-1, 11], 1, Concat, [1]],  # cat head P5           [1,1024,20,20]
   [-1, 3, C33D, [1024, False]],  # 23 (P5/32-large)      [1,1024,20,20]**

   [[18, 21, 24], 1, Detect, [nc,action_nc, anchors]],  # Detect(P3, P4, P5)
  ]
